var list = [ 'มาฆบูชานั้น ย่อมาจากคำว่า"มาฆบุรณมี" แปลว่าการบูชาพระในวันเพ็ญ เดือน ๓ วันมาฆบูชาจึงตรงกับวันขึ้น ๑๕ ค่ำ เดือน ๓ <br>แต่ถ้าปีใดมีเดือน อธิกมาส คือมีเดือน ๘ สองครั้ง วันมาฆบูชาก็จะเลื่อนไปเป็นวันขึ้น ๑๕ ค่ำ เดือน ๔ เป็นวันสำคัญวันหนึ่ง ในวันพุทธศาสนา คือวันที่มีการประชุมสังฆสันนิบาตครั้งใหญ่ในพุทธศาสนา ที่เรียกว่า "จาตุรงคสันนิบาต" และเป็นวันที่พระสัมมาสัมพุทธเจ้าได้ทรงแสดงโอวาทปฎิโมกข์แก่พระสงฆ์สาวกเป็นครั้งแรก ณ เวฬุวันวิหาร กรุงราชคฤห์ เพื่อให้พระสงฆ์นำไปประพฤติปฏิบัติ เพื่อจะยังพระพุทธศาสนาให้เจริญรุ่งเรืองต่อไป',
'ความหมาย คำว่า "วิสาขบูชา" หมายถึงการบูชาในวันเพ็ญเดือน ๖ วิสาขบูชา ย่อมาจาก " วิสาขปุรณมีบูชา " แปลว่า " การบูชาในวันเพ็ญเดือนวิสาขะ " ถ้าปีใดมีอธิกมาส คือ มีเดือน ๘ สองหน ก็เลื่อนไปเป็นกลางเดือน ๗ ความสำคัญ วันวิสาขบูชา เป็นวันสำคัญยิ่งทางพระพุทธศาสนา เพราะเป็นวันที่พระพุทธเจ้าประสูติ คือเกิด ได้ตรัสรู้ คือสำเร็จ ได้ปรินิพพาน คือ ดับ เกิดขึ้นตรงกันทั้ง ๓ คราวคือ <br> ๑. เมื่อเจ้าชายสิทธัตถะประสูติที่พระราชอุทยานลุมพินีวัน <br>๒. เมื่อเจ้าชายสิทธัตถะตรัสรู้ <br> ๓.เสด็จดับขันธปรินิพพาน',  'เมื่อพระพุทธเจ้าเสด็จปรินิพพานแล้ว ๘ วัน มัลลกษัตริย์แห่งนครกุสินารา พร้อมด้วยประชาชน และพระสงฆ์อันมีพระมหากัสสปเถระเป็นประธาน ได้พร้อมกันกระทำการถวายพระเพลิงพุทธสรีระ ณ มกุฏพันธนเจดีแห่งกรุงกุสินารา วันนั้นเป็นวันหนึ่งที่ชาวพุทธต้องมีความสังเวชสลดใจ และวิปโยคโศกเศร้าเป็นอย่างยิ่ง เพราะการสูญเสียแห่งพระพุทธสรีระ เมื่อวันแรม ๘ ค่ำ เดือน ๖ ซึ่งนิยมเรียกกันว่าวันอัฏฐมีนั้นเวียนมาบรรจบแต่ละปี พุทธศาสนิกชนบางส่วน โดยเฉพาะพระสงฆ์และอุบาสกอุบาสิกาแห่งวัดนั้น ๆ ได้พร้อมกันประกอบพิธีบูชาขึ้น เป็นการเฉพาะภายในวัด เช่นที่ปฏิบัติกันอยู่ในวัดมหาธาตุยุวราชรังสฤษฏิ์ เป็นต้น แต่จะปฏิบัติกันมาแต่เมื่อใด ไม่พบหลักฐาน ปัจจุบันนี้ก็ยังถือปฏิบัติกันอยู่',
 ' วันขึ้น ๑๕ ค่ำ เดือน ๘ นับเป็นวันที่สำคัญในประวัติศาสตร์แห่งพระพุทธศาสนา คือวันที่พระพุทธองค์ทรงแสดงธรรมเทศนาหรือหลักธรรมที่ทรงตรัสรู้เป็นครั้งแรกแก่เบญจวัคคีย์ทั้ง ๕ ณ มฤคทายวัน ตำบลอิสิปตนะ เมืองพาราณสี ในชมพูทวีปสมัยโบราณ ซึ่งปัจจุบันตั้งอยู่ในประเทศอินเดีย ด้วยพระพุทธองค์ทรงเปรียบดังผู้ทรงเป็นธรรมราชา ก็ทรงบันลือธรรมเภรียังล้อแห่งธรรมให้หมุนรุดหน้า เริ่มต้นแผ่ขยายอาณาจักรแห่งธรรม นำความร่มเย็นและความสงบสุขมาให้แก่หมู่ประชา', 'ตั้งแต่สมัยพุทธกาล เมื่อครั้งที่องค์สมเด็จพระสัมมาสัมพุทธเจ้ายังทรงมีพระชนม์อยู่ ได้ทรงเสด็จไปยังทุกแห่งหน เพื่อสั่งสอนหลักธรรมอันประเสริฐ จนมีพุทธสาวกมากมาย โดยมุ่งเน้นให้เกิดประโยชน์สุขแก่หมู่มวลมนุษย์โลก พระองค์ได้เสด็จไปยังถิ่นทุรกันดารในทุกฤดูกาล ต่อมา ปรากฏว่าในช่วงพรรษาหรือช่วงฤดูฝนได้มีผู้ร้องขอต่อพระองค์ว่าได้เกิดความเสียหาย แก่ข้าวกล้าเพราะถูกเหยียบโดยพุทธบริษัทซึ่งไม่ได้เจตนา ดังนั้นพระองค์จึงออกพุทธบัญญัติกำหนดให้ พระสงฆ์ทุกรูปจำพรรษาเป็นหลักเป็นแหล่งในช่วงฤดูฝน โดยให้เริ่มตั้งแต่วันแรม 1 ค่ำ เดือน 8 จนกระทั่งถึงวันขึ้น 15 ค่ำเดือน 11 นับเป็น เวลา 3 เดือน ในวันเข้าพรรษานี้ จะมีการทำบุญตักบาตร ถวายผ้าอาบน้ำฝนและจตุปัจจัยแก่ พระภิกษุ สามเณร รวมทั้งยังมีการ ถวายเทียนพรรษา แก่วัดอีกด้วย', 
 'วันออกพรรษานี้ เรียกอีกอย่างหนึ่งว่า "วันมหาปวารณา" คำว่า "ปวารณา" แปลว่า "อนุญาต" หรือ "ยอมให้" คือ เป็นวันที่เปิดโอกาสให้พระภิกษุสงฆ์ด้วยกันว่ากล่าวตักเตือนกันได้ ในข้อที่ผิดพลั้งล่วงเกินระหว่างที่จำพรรษาอยู่ด้วยกัน ในวันออกพรรษานี้กิจที่ชาวบ้านมักจะกระทำก็คือ การบำเพ็ญกุศล เช่น ทำบุญตักบาตร จัดดอกไม้ ธูป เทียน ไปบูชาพระที่วัด และฟังพระธรรมเทศนา ของที่ชาวพุทธนิยมนำไปใส่บาตรในวันนี้ก็คือ ข้าวต้ม มัดไต้ และข้าวต้มลูกโยน และการร่วมกุศลกรรมการ "ตักบาตรเทโว" คำว่า "เทโว" ย่อมาจาก"เทโวโรหน" แปลว่าการเสด็จจากเทวโลกการตักบาตรเทโว จึงเป็นการระลึกถึงวันที่ พระพุทธองค์เสด็จกลับจากการโปรด พระพุทธมารดาในเทวโลก'];
 


$(document).ready(function(){
    $(window).scroll(function(){
        var wintop = $(window).scrollTop(), docheight = 
    $(document).height(), winheight = $(window).height();
            var scrolled = (wintop/(docheight-winheight))*100;
    $('.menu').css('background-image', ("linear-gradient(to right, orange "+scrolled+"%, #99460e)"));
    });

    var tmp = "-"
    $('.ld').click(function(){
      $("#box").css("height", "180vh");
      if(tmp != "-"){
        $("#"+tmp).removeClass('clicked');
      }
      $(this).addClass('clicked');
      tmp = $(this).attr('id');
      var num = ($(this).attr('id')[3]-1);
      $(".detail").html(list[num]);
      $(".detail").append($("<div><img id='detailpic' src='../img/"+(num+1)+".jpg'></div>"));
      $(".detail").addClass("call");
    });

});